mtosi_1.1/IIS/xml/inventory/getInventory_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ../../xsd/common/header.xsd tmf854.v1 ../../xsd/interfaces/InventoryRetrieval.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <header tmf854Version="1.0">
      <activityName>getInventory</activityName>
      <msgName>getInventory</msgName>
      <msgType>REQUEST</msgType>
      <correlationId>0001</correlationId>
      <senderURI>/MTOSI/InventoryOS</senderURI>
      <destinationURI>/MTOSI/EMS01</destinationURI>
      <!-- MEP inputs -->
      <!-- MSG style -->
      <!-- MultipleBatch with max of 500 MTOSI objects/batch -->
      <communicationPattern>MultipleBatchResponse</communicationPattern>
      <communicationStyle>MSG</communicationStyle>
      <requestedBatchSize>500</requestedBatchSize>
      <timestamp>20051004140305</timestamp>
    </header>
  </soap:Header>
  <soap:Body>
		<getInventory tmf854Version="1.0">
		<!-- default filter to retrieve the entire network managed by the target OS (an EMS) -->
			<filter/>
    </getInventory>
  </soap:Body>
</soap:Envelope>
